Revit 2026 API
AnnotationMultipleAlignmentUtils Methods
The AnnotationMultipleAlignmentUtils type exposes the following members.
Methods
Name | Description
Dispose
ElementSupportsMultiAlign |  Returns true if element can be aligned to other similar elements.
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAnnotationOutlineWithoutLeaders |  Gets the four corners of the alignable element in model space without its leaders.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
MoveWithAnchoredLeaders |  Moves the element while keeping the leader end points anchored.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
AnnotationMultipleAlignmentUtils Class
Autodesk.Revit.DB Namespace